chore: cleanup project for GitHub and update README
